In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
d = {'a':1,'b':2,'c':3}
ser =pd.Series(data=d)
ser

a    1
b    2
c    3
dtype: int64

In [4]:
d = {'a':1,'b':2,'c':3}
ser=pd.Series(data=d,index=['a','y','c'])
ser

a    1.0
y    NaN
c    3.0
dtype: float64

In [5]:
l=['banana',42]
s=pd.Series(data=1)
print(s)

0    1
dtype: int64

In [6]:
s=pd.Series(['Wes Mckinney','Creator of pandas'],index=['person','who'])
print(s)

person         Wes Mckinney
who       Creator of pandas
dtype: object

In [7]:
pricelist=[100,200,300,400]

productseries=pd.Series(pricelist)

print(productseries)

0    100
1    200
2    300
3    400
dtype: int64

In [8]:
d= {'col1':[1,2],'col2':[3,4]}
df =pd.DataFrame(data=d)
df

   col1  col2
0     1     3
1     2     4

In [9]:
type(df)

pandas.core.frame.DataFrame

In [10]:
scientists=pd.DataFrame({
'name':['Rosline Frankline','william gosset'],
'occupation':['chemist','statician'],
'born':['1958-07-25','1876-06-13'],
'died':['1958-04-16','1937-10-16'],
'age':[37,61]})
print(scientists)

                name occupation        born        died  age
0  Rosline Frankline    chemist  1958-07-25  1958-04-16   37
1     william gosset  statician  1876-06-13  1937-10-16   61

In [11]:
productdf=pd.DataFrame([[100,200,300,400],[4,1,5,6]],columns=['pen','shirt','book','mouse'])

print(productdf)

   pen  shirt  book  mouse
0  100    200   300    400
1    4      1     5      6

In [12]:
productdf.shape

(2, 4)

In [13]:
productdf.size

8

In [28]:
productdf.keys()

Index(['pen', 'shirt', 'book', 'mouse'], dtype='object')

In [30]:
productdf.columns

Index(['pen', 'shirt', 'book', 'mouse'], dtype='object')

In [32]:
productdf["mobile"] =[15000,2]
productdf

   pen  shirt  book  mouse  mobile
0  100    200   300    400   15000
1    4      1     5      6       2

In [34]:
df2 = productdf.drop("mobile",axis=1)
df2

   pen  shirt  book  mouse
0  100    200   300    400
1    4      1     5      6

In [36]:
df2 = productdf.drop(columns = ["mobile"])
df2

   pen  shirt  book  mouse
0  100    200   300    400
1    4      1     5      6

In [38]:
df2 = productdf.drop(columns = ["mobile",'book'])
df2

   pen  shirt  mouse
0  100    200    400
1    4      1      6

In [42]:
productdf = productdf.drop(columns =["mobile"])
productdf

   pen  shirt  book  mouse
0  100    200   300    400
1    4      1     5      6

In [44]:
df3=df2.drop(index=[0])
df3

   pen  shirt  mouse
1    4      1      6

In [46]:
productdf2=pd.DataFrame([[15,16,17,18],[5,6,7,8]],columns=['pen','shirt','book','mouse'])
productdf2

   pen  shirt  book  mouse
0   15     16    17     18
1    5      6     7      8

In [50]:
df5 = productdf.append(productdf2)
df5

AttributeError: 'DataFrame' object has no attribute 'append'

In [52]:
productdf3=pd.DataFrame([[15,16,17,18],[5,6,7,8]],columns=['pen','shirt','book','mouse'])
productdf3

   pen  shirt  book  mouse
0   15     16    17     18
1    5      6     7      8

In [54]:
productdf.append(productdf3)

AttributeError: 'DataFrame' object has no attribute 'append'

In [56]:
india_weather = pd.DataFrame({
"city":["mumbai","delhi","banglore"],
"temperature":[32,45,30],
"humidity":[80,60,78]
})
india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [60]:
us_weather = pd.DataFrame({
"city":["new york","chicago","orlando"],
"temperature":[32,45,30],
"humidity":[80,60,78]
})
us_weather

       city  temperature  humidity
0  new york           32        80
1   chicago           45        60
2   orlando           30        78

In [64]:
df = pd.concat([india_weather,us_weather])
df

       city  temperature  humidity
0  new york           32        80
1   chicago           45        60
2   orlando           30        78
0  new york           32        80
1   chicago           45        60
2   orlando           30        78

In [66]:
df = pd.concat([india_weather,us_weather], ignore_index=True)
df

       city  temperature  humidity
0  new york           32        80
1   chicago           45        60
2   orlando           30        78
3  new york           32        80
4   chicago           45        60
5   orlando           30        78

In [68]:
df = pd.concat([india_weather,us_weather],axis=0)
df

       city  temperature  humidity
0  new york           32        80
1   chicago           45        60
2   orlando           30        78
0  new york           32        80
1   chicago           45        60
2   orlando           30        78

In [70]:
temperature_df = pd.DataFrame({
"city":["mumbai","delhi","banglore"],
"temperature":[32,45,30]})
temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [72]:
humidity_df = pd.DataFrame({
"city":["mumbai","delhi","banglore"],
"humidity":[80,60,78]})
humidity_df

       city  humidity
0    mumbai        80
1     delhi        60
2  banglore        78

In [74]:
df = pd.merge(temperature_df,humidity_df,on='city')
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [80]:
df = pd.merge(temperature_df,humidity_df,on='city', how ='outer')
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [82]:
df = pd.read_csv(r"C:\Users\Dell\Downloads\archive\Covid Data.csv")
df.head()

,USMER,MEDICAL_UNIT,SEX,PATIENT_TYPE,DATE_DIED,INTUBED,PNEUMONIA,AGE,PREGNANT,DIABETES,...,ASTHMA,INMSUPR,HIPERTENSION,OTHER_DISEASE,CARDIOVASCULAR,OBESITY,RENAL_CHRONIC,TOBACCO,CLASIFFICATION_FINAL,ICU
0,2,1,1,1,03/05/2020,97,1,65,2,2,...,2,2,1,2,2,2,2,2,3,97
1,2,1,2,1,03/06/2020,97,1,72,97,2,...,2,2,1,2,2,1,1,2,5,97
2,2,1,2,2,09/06/2020,1,2,55,97,1,...,2,2,2,2,2,2,2,2,3,2
3,2,1,1,1,12/06/2020,97,2,53,2,2,...,2,2,2,2,2,2,2,2,7,97
4,2,1,2,1,21/06/2020,97,2,68,97,1,...,2,2,1,2,2,2,2,2,3,97